const mockArray = {};
const commentsId = new Set;
const photosColection = new Set;
const names = [
    'Анна', 'Богдан', 'Василь', 'Галина', 'Дмитро',
    'Євгенія', 'Жанна', 'Зеновій', 'Ігор', 'Йосип',
    'Катерина', 'Леся', 'Максим', 'Наталія', 'Олександр',
    'Павло', 'Роксолана', 'Сергій', 'Тетяна', 'Уляна',
    'Федір', 'Христина', 'Цезар', 'Чеслав', 'Шарлотта'
  ];
const photoDescriptions = [
    'Нічний мегаполіс, освітлений світловими рекламами.',
    'Кібернетичний самурай, обладнаний високотехнологічним озброєнням.',
    'Таємничий хакер, який проникає в корпоративну мережу.',
    'Густий туман над кіберпростором, заповнений світловими сигналами.',
    'Робот-кумпаньйон у вигляді штучного інтелекту.',
    'Панорамний вид на велике місто, повне гігантських хмарочосів.',
    'Дістопійний кібермайданчик із зламаними андроїдами.',
    'Спілка хакерів, збираючись для великої атаки.',
    'Електронна реклама на високих вежах і над магістральними шляхами.',
    'Кібер-кафе з аркадними ігровими автоматами та VR-розвагами.',
    'Агент з таємної кіберполіції в броньованому костюмі.',
    'Багатокімнатний кібернетичний ліжко в ультрасучасному житловому комплексі.',
    'Темний алеї міста, заселеного кібернетичними гангами.',
    'Вогняні струміні по вулиці, виникаючи від розривів в кібермережі.',
    'Мерехтливі світлові фітовершини на дахах хмарочосів.',
    'Бойовий дрон, обслуговуваний кібернетичним пілотом.',
    'Кіберпанк-художник, що творить на вулиці міста.',
    'Андроїд-бармен в кібернетичному клубі.',
    'Незаконний кібербазар із забороненими технологіями.',
    'Кіберпротест проти корпоративного утискання.',
    'Нейроімплантати та кіберпротези на ярмарці майбутнього.',
    'Шумна кібернетична арена для бійців з підсиленою реальністю.',
    'Кіберкот, обладнаний датчиками та штучним інтелектом.',
    'Містичний кіберзахід, коли світлові плями сходять за горизонт.',
    'Жвава атмосфера кібер-бару з великою кількістю мерехтливих неонових вогників.'
  ];
  

function mockArrayFiller () {
    const min = 1;
    const max = 25;
    const minLikes = 15;
    const maxLikes = 200;
    for (let i = 0; i < max; i++) {
        mockArray[i] = {};
        mockArray[i].id = i + 1;
        mockArray[i].url = `photos/${getRandomPhotos(min, max)}`;
        mockArray[i].description = photoDescriptions[i];
        mockArray[i].likes = getRandomNumber(minLikes, maxLikes);
    };
}

function getRandomNumber (min, max) {
    return Math.floor(Math.random() * (max - min + 1) + min);
};



function getRandomPhotos (min, max) {
    let number = 0;
  do {
    number = getRandomNumber(min, max);
  } while (photosColection.has(number))
  photosColection.add(number);
  return number;
}


mockArrayFiller()
console.log(mockArray, 'mockArray');
console.log(photosColection, 'photosColection')
